Autodesk.Navisworks.Api.ApplicationParts.IApplicationGui
Provides access to the Gui of the application which is hosting the API.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationGui.Closed
Occurs when the Gui (including the main window) is about to close.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationGui.Closing
Occurs when the Gui is about to close and can be handled to cancel closure.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationGui.GetDockPanePluginVisibility(System.String)
Called when a DockPanePlugin gets it's Visible property
pluginId:  The full identifier for the plugin.
This is formed as Name.DeveloperId

Autodesk.Navisworks.Api.ApplicationParts.IApplicationGui.IsSignedIn
Reports if there is an authenticated user.
Returns: Sign In status.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationGui.MainWindow
Get the main window of the application. Use as parent window for dialogs and message boxes.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationGui.ServerType
Sign In server type.
Returns: Server Type.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationGui.ServerTypeChanged
Occurs when the server type changes.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationGui.SetDockPanePluginActive(System.String)
Called when a DockPanePlugin activates the plugin pane.
pluginId:  The full identifier for the plugin.
This is formed as Name.DeveloperId

Autodesk.Navisworks.Api.ApplicationParts.IApplicationGui.SetDockPanePluginVisibility(System.String,System.Boolean)
Called when a DockPanePlugin sets it's Visible property
pluginId:  The full identifier for the plugin.
This is formed as Name.DeveloperId
visible:
The value to set

Autodesk.Navisworks.Api.ApplicationParts.IApplicationGui.SetRaiseIdle(System.Action{System.EventArgs})
Allows Idle to be raised.
raiseIdle:
Action to raise Idle. Will be called with valid Action during GUI
creation, and with null during GUI destruction.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationGui.SignedIn
Occurs when user signs in.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationGui.SignedOut
Occurs when user has signed out.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationGui.SignIn
Authenticate with Autodesk ID. Popup generic sign-in UI in Navisworks to allow users to enter the credentials.
Returns: true if authenticated or false if failed to authenticate.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationGui.SigningOut
Occurs when user is signing out.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationGui.SignInUserId
The internal user ID of the user currently logged in. The user ID will be null if no user is logged in.
Returns: Internal user ID. Null if no user is authenticated.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationGui.SignInUserName
The current authenticated user's Autodesk ID.
Returns: Autodesk ID. Null if no user is authenticated.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationGui.SignOut
Sign-out the current authenticated user.
Returns: true if succeeded or false if failed.